#+Property: Header-args :tangle-mode (identity #o444) :mkdirp yes
#+auto_tangle: t
#+AUTHOR: Richard Redcroft

* MBSync

** Redcroft
#+begin_src conf :tangle "~/.mbsyncrc"
  IMAPAccount Redcroft
  Host imap.hostinger.com
  User richard@redcroft.tech
  PassCmd "rbw get Hostinger"
  TLSType IMAPS
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore redcroft-remote
  Account Redcroft

  MaildirStore redcroft-local
  SubFolders Verbatim
  Path ~/.mail/redcroft/
  Inbox ~/.mail/redcroft/Inbox

  Channel redcroft
  Far :redcroft-remote:
  Near :redcroft-local:
  Patterns *
  Create Both
  Expunge Both
  SyncState *
#+end_src

** Work
#+begin_src conf :tangle "~/.mbsyncrc"
  IMAPAccount Work
  Host imap.gmail.com
  User richard@carseandwaterman.com
  PassCmd "rbw get GMail richard@carseandwaterman.com"
  TLSType IMAPS
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore work-remote
  Account Work

  MaildirStore work-local
  SubFolders Verbatim
  Path ~/.mail/work/
  Inbox ~/.mail/work/Inbox

  Channel work
  Far :work-remote:
  Near :work-local:
  Patterns *
  Create Both
  Expunge Both
  SyncState *
#+end_src

** GMail
#+begin_src conf :tangle "~/.mbsyncrc"
  IMAPAccount GMail
  Host imap.gmail.com
  User animationrich@gmail.com
  PassCmd "rbw get GMail animationrich@gmail.com"
  TLSType IMAPS
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore gmail-remote
  Account GMail

  MaildirStore gmail-local
  SubFolders Verbatim
  Path ~/.mail/gmail/
  Inbox ~/.mail/gmail/Inbox

  Channel gmail
  Far :gmail-remote:
  Near :gmail-local:
  Patterns *
  Create Both
  Expunge Both
  SyncState *
#+end_src


* Config
#+begin_src sh :results output
  mu init --maildir ~/.mail --my-address=richard@redcroft.tech --my-address=animationrich@gmail.com --my-address=richard@carseandwaterman.com
  mu index
  touch ~/Tangle
#+end_src

#+RESULTS:
#+begin_example
mu has been created with the following properties:
+-------------------+-------------------------------+
| property          | value                         |
+-------------------+-------------------------------+
| maildir           | /home/lambda/.mail            |
+-------------------+-------------------------------+
| database-path     | /home/lambda/.cache/mu/xapian |
+-------------------+-------------------------------+
| schema-version    | 500                           |
+-------------------+-------------------------------+
| max-message-size  | 100000000                     |
+-------------------+-------------------------------+
| batch-size        | 50000                         |
+-------------------+-------------------------------+
| created           | Mon Jan 27 14:36:29 2025      |
+-------------------+-------------------------------+
| personal-address  | richard@redcroft.tech         |
+-------------------+-------------------------------+
| personal-address  | animationrich@gmail.com       |
+-------------------+-------------------------------+
| personal-address  | richard@carseandwaterman.com  |
+-------------------+-------------------------------+
| messages in store | 0                             |
+-------------------+-------------------------------+
| support-ngrams    | no                            |
+-------------------+-------------------------------+
| last-change       | never                         |
+-------------------+-------------------------------+
| last-index        | never                         |
+-------------------+-------------------------------+
Database is empty. You can use 'mu index' to fill it.
indexing maildir /home/lambda/.mail -> store /home/lambda/.cache/mu/xapian
\ indexing messages; checked: 0; updated/new: 0; cleaned-up: 0| indexing messages; checked: 45; updated/new: 44; cleaned-up: 0/ indexing messages; checked: 97; updated/new: 96; cleaned-up: 0- indexing messages; checked: 160; updated/new: 159; cleaned-up: 0\ indexing messages; checked: 218; updated/new: 217; cleaned-up: 0| indexing messages; checked: 269; updated/new: 268; cleaned-up: 0/ indexing messages; checked: 314; updated/new: 313; cleaned-up: 0- indexing messages; checked: 364; updated/new: 363; cleaned-up: 0\ indexing messages; checked: 413; updated/new: 412; cleaned-up: 0| indexing messages; checked: 455; updated/new: 454; cleaned-up: 0/ indexing messages; checked: 503; updated/new: 502; cleaned-up: 0- indexing messages; checked: 547; updated/new: 546; cleaned-up: 0\ indexing messages; checked: 592; updated/new: 591; cleaned-up: 0| indexing messages; checked: 639; updated/new: 638; cleaned-up: 0/ indexing messages; checked: 682; updated/new: 681; cleaned-up: 0- indexing messages; checked: 723; updated/new: 722; cleaned-up: 0\ indexing messages; checked: 769; updated/new: 768; cleaned-up: 0| indexing messages; checked: 816; updated/new: 815; cleaned-up: 0/ indexing messages; checked: 856; updated/new: 855; cleaned-up: 0- indexing messages; checked: 907; updated/new: 906; cleaned-up: 0\ indexing messages; checked: 957; updated/new: 956; cleaned-up: 0| indexing messages; checked: 1007; updated/new: 1006; cleaned-up: 0/ indexing messages; checked: 1039; updated/new: 1038; cleaned-up: 0- indexing messages; checked: 1074; updated/new: 1073; cleaned-up: 0\ indexing messages; checked: 1102; updated/new: 1101; cleaned-up: 0| indexing messages; checked: 1144; updated/new: 1143; cleaned-up: 0/ indexing messages; checked: 1182; updated/new: 1181; cleaned-up: 0- indexing messages; checked: 1216; updated/new: 1215; cleaned-up: 0\ indexing messages; checked: 1251; updated/new: 1250; cleaned-up: 0| indexing messages; checked: 1282; updated/new: 1281; cleaned-up: 0/ indexing messages; checked: 1317; updated/new: 1316; cleaned-up: 0- indexing messages; checked: 1352; updated/new: 1351; cleaned-up: 0\ indexing messages; checked: 1387; updated/new: 1386; cleaned-up: 0| indexing messages; checked: 1428; updated/new: 1427; cleaned-up: 0/ indexing messages; checked: 1465; updated/new: 1464; cleaned-up: 0- indexing messages; checked: 1503; updated/new: 1502; cleaned-up: 0\ indexing messages; checked: 1533; updated/new: 1532; cleaned-up: 0| indexing messages; checked: 1570; updated/new: 1569; cleaned-up: 0/ indexing messages; checked: 1604; updated/new: 1603; cleaned-up: 0- indexing messages; checked: 1639; updated/new: 1638; cleaned-up: 0\ indexing messages; checked: 1677; updated/new: 1676; cleaned-up: 0| indexing messages; checked: 1706; updated/new: 1705; cleaned-up: 0/ indexing messages; checked: 1740; updated/new: 1739; cleaned-up: 0- indexing messages; checked: 1769; updated/new: 1768; cleaned-up: 0\ indexing messages; checked: 1801; updated/new: 1800; cleaned-up: 0| indexing messages; checked: 1837; updated/new: 1836; cleaned-up: 0/ indexing messages; checked: 1879; updated/new: 1878; cleaned-up: 0- indexing messages; checked: 1916; updated/new: 1915; cleaned-up: 0\ indexing messages; checked: 1952; updated/new: 1951; cleaned-up: 0| indexing messages; checked: 1982; updated/new: 1981; cleaned-up: 0/ indexing messages; checked: 2016; updated/new: 2015; cleaned-up: 0- indexing messages; checked: 2050; updated/new: 2049; cleaned-up: 0\ indexing messages; checked: 2082; updated/new: 2081; cleaned-up: 0| indexing messages; checked: 2116; updated/new: 2115; cleaned-up: 0/ indexing messages; checked: 2150; updated/new: 2149; cleaned-up: 0- indexing messages; checked: 2188; updated/new: 2187; cleaned-up: 0\ indexing messages; checked: 2224; updated/new: 2223; cleaned-up: 0| indexing messages; checked: 2258; updated/new: 2257; cleaned-up: 0/ indexing messages; checked: 2295; updated/new: 2294; cleaned-up: 0- indexing messages; checked: 2332; updated/new: 2331; cleaned-up: 0\ indexing messages; checked: 2362; updated/new: 2361; cleaned-up: 0| indexing messages; checked: 2400; updated/new: 2399; cleaned-up: 0/ indexing messages; checked: 2438; updated/new: 2437; cleaned-up: 0- indexing messages; checked: 2477; updated/new: 2476; cleaned-up: 0\ indexing messages; checked: 2507; updated/new: 2506; cleaned-up: 0| indexing messages; checked: 2546; updated/new: 2545; cleaned-up: 0/ indexing messages; checked: 2586; updated/new: 2585; cleaned-up: 0- indexing messages; checked: 2630; updated/new: 2629; cleaned-up: 0\ indexing messages; checked: 2670; updated/new: 2669; cleaned-up: 0| indexing messages; checked: 2703; updated/new: 2702; cleaned-up: 0/ indexing messages; checked: 2751; updated/new: 2750; cleaned-up: 0- indexing messages; checked: 2788; updated/new: 2787; cleaned-up: 0\ indexing messages; checked: 2823; updated/new: 2822; cleaned-up: 0| indexing messages; checked: 2861; updated/new: 2860; cleaned-up: 0/ indexing messages; checked: 2894; updated/new: 2893; cleaned-up: 0- indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0\ indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0| indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0/ indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0- indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0\ indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0| indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0/ indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0- indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0\ indexing messages; checked: 2895; updated/new: 2894; cleaned-up: 0| indexing messages; checked: 2899; updated/new: 2898; cleaned-up: 0/ indexing messages; checked: 2933; updated/new: 2932; cleaned-up: 0- indexing messages; checked: 2965; updated/new: 2964; cleaned-up: 0\ indexing messages; checked: 3000; updated/new: 2999; cleaned-up: 0| indexing messages; checked: 3036; updated/new: 3035; cleaned-up: 0/ indexing messages; checked: 3065; updated/new: 3064; cleaned-up: 0- indexing messages; checked: 3096; updated/new: 3095; cleaned-up: 0\ indexing messages; checked: 3126; updated/new: 3125; cleaned-up: 0| indexing messages; checked: 3156; updated/new: 3155; cleaned-up: 0/ indexing messages; checked: 3189; updated/new: 3188; cleaned-up: 0- indexing messages; checked: 3223; updated/new: 3222; cleaned-up: 0\ indexing messages; checked: 3255; updated/new: 3254; cleaned-up: 0| indexing messages; checked: 3298; updated/new: 3297; cleaned-up: 0/ indexing messages; checked: 3329; updated/new: 3328; cleaned-up: 0- indexing messages; checked: 3360; updated/new: 3359; cleaned-up: 0\ indexing messages; checked: 3389; updated/new: 3388; cleaned-up: 0| indexing messages; checked: 3430; updated/new: 3429; cleaned-up: 0/ indexing messages; checked: 3467; updated/new: 3466; cleaned-up: 0- indexing messages; checked: 3500; updated/new: 3499; cleaned-up: 0\ indexing messages; checked: 3535; updated/new: 3534; cleaned-up: 0| indexing messages; checked: 3567; updated/new: 3566; cleaned-up: 0/ indexing messages; checked: 3594; updated/new: 3593; cleaned-up: 0- indexing messages; checked: 3628; updated/new: 3627; cleaned-up: 0\ indexing messages; checked: 3670; updated/new: 3669; cleaned-up: 0| indexing messages; checked: 3707; updated/new: 3706; cleaned-up: 0/ indexing messages; checked: 3738; updated/new: 3737; cleaned-up: 0- indexing messages; checked: 3770; updated/new: 3769; cleaned-up: 0\ indexing messages; checked: 3804; updated/new: 3803; cleaned-up: 0| indexing messages; checked: 3836; updated/new: 3835; cleaned-up: 0/ indexing messages; checked: 3868; updated/new: 3867; cleaned-up: 0- indexing messages; checked: 3902; updated/new: 3901; cleaned-up: 0\ indexing messages; checked: 3928; updated/new: 3928; cleaned-up: 0| indexing messages; checked: 3964; updated/new: 3963; cleaned-up: 0/ indexing messages; checked: 3997; updated/new: 3996; cleaned-up: 0- indexing messages; checked: 4038; updated/new: 4037; cleaned-up: 0\ indexing messages; checked: 4089; updated/new: 4088; cleaned-up: 0| indexing messages; checked: 4147; updated/new: 4146; cleaned-up: 0/ indexing messages; checked: 4239; updated/new: 4238; cleaned-up: 0- indexing messages; checked: 4332; updated/new: 4331; cleaned-up: 0\ indexing messages; checked: 4391; updated/new: 4390; cleaned-up: 0| indexing messages; checked: 4416; updated/new: 4415; cleaned-up: 0/ indexing messages; checked: 4451; updated/new: 4450; cleaned-up: 0- indexing messages; checked: 4489; updated/new: 4488; cleaned-up: 0\ indexing messages; checked: 4528; updated/new: 4527; cleaned-up: 0| indexing messages; checked: 4564; updated/new: 4563; cleaned-up: 0/ indexing messages; checked: 4587; updated/new: 4586; cleaned-up: 0- indexing messages; checked: 4609; updated/new: 4608; cleaned-up: 0\ indexing messages; checked: 4636; updated/new: 4635; cleaned-up: 0| indexing messages; checked: 4683; updated/new: 4682; cleaned-up: 0/ indexing messages; checked: 4723; updated/new: 4722; cleaned-up: 0- indexing messages; checked: 4754; updated/new: 4753; cleaned-up: 0\ indexing messages; checked: 4798; updated/new: 4797; cleaned-up: 0| indexing messages; checked: 4846; updated/new: 4845; cleaned-up: 0/ indexing messages; checked: 4879; updated/new: 4878; cleaned-up: 0- indexing messages; checked: 4887; updated/new: 4886; cleaned-up: 0\ indexing messages; checked: 4918; updated/new: 4917; cleaned-up: 0| indexing messages; checked: 4954; updated/new: 4953; cleaned-up: 0/ indexing messages; checked: 4996; updated/new: 4995; cleaned-up: 0- indexing messages; checked: 5034; updated/new: 5033; cleaned-up: 0\ indexing messages; checked: 5069; updated/new: 5068; cleaned-up: 0| indexing messages; checked: 5102; updated/new: 5101; cleaned-up: 0/ indexing messages; checked: 5131; updated/new: 5130; cleaned-up: 0- indexing messages; checked: 5173; updated/new: 5172; cleaned-up: 0\ indexing messages; checked: 5212; updated/new: 5211; cleaned-up: 0| indexing messages; checked: 5245; updated/new: 5244; cleaned-up: 0/ indexing messages; checked: 5278; updated/new: 5277; cleaned-up: 0- indexing messages; checked: 5317; updated/new: 5316; cleaned-up: 0\ indexing messages; checked: 5385; updated/new: 5384; cleaned-up: 0| indexing messages; checked: 5446; updated/new: 5445; cleaned-up: 0/ indexing messages; checked: 5487; updated/new: 5486; cleaned-up: 0- indexing messages; checked: 5522; updated/new: 5521; cleaned-up: 0\ indexing messages; checked: 5548; updated/new: 5547; cleaned-up: 0| indexing messages; checked: 5596; updated/new: 5595; cleaned-up: 0/ indexing messages; checked: 5642; updated/new: 5641; cleaned-up: 0- indexing messages; checked: 5695; updated/new: 5694; cleaned-up: 0\ indexing messages; checked: 5740; updated/new: 5739; cleaned-up: 0| indexing messages; checked: 5779; updated/new: 5778; cleaned-up: 0/ indexing messages; checked: 5789; updated/new: 5788; cleaned-up: 0- indexing messages; checked: 5802; updated/new: 5801; cleaned-up: 0\ indexing messages; checked: 5829; updated/new: 5828; cleaned-up: 0| indexing messages; checked: 5865; updated/new: 5864; cleaned-up: 0/ indexing messages; checked: 5908; updated/new: 5907; cleaned-up: 0- indexing messages; checked: 5955; updated/new: 5954; cleaned-up: 0\ indexing messages; checked: 5991; updated/new: 5990; cleaned-up: 0| indexing messages; checked: 6021; updated/new: 6020; cleaned-up: 0/ indexing messages; checked: 6056; updated/new: 6055; cleaned-up: 0- indexing messages; checked: 6084; updated/new: 6083; cleaned-up: 0\ indexing messages; checked: 6125; updated/new: 6124; cleaned-up: 0| indexing messages; checked: 6161; updated/new: 6160; cleaned-up: 0/ indexing messages; checked: 6191; updated/new: 6190; cleaned-up: 0- indexing messages; checked: 6224; updated/new: 6223; cleaned-up: 0\ indexing messages; checked: 6265; updated/new: 6264; cleaned-up: 0| indexing messages; checked: 6333; updated/new: 6332; cleaned-up: 0/ indexing messages; checked: 6370; updated/new: 6369; cleaned-up: 0- indexing messages; checked: 6397; updated/new: 6396; cleaned-up: 0\ indexing messages; checked: 6441; updated/new: 6440; cleaned-up: 0| indexing messages; checked: 6476; updated/new: 6475; cleaned-up: 0/ indexing messages; checked: 6507; updated/new: 6506; cleaned-up: 0- indexing messages; checked: 6535; updated/new: 6534; cleaned-up: 0\ indexing messages; checked: 6569; updated/new: 6568; cleaned-up: 0| indexing messages; checked: 6603; updated/new: 6602; cleaned-up: 0/ indexing messages; checked: 6640; updated/new: 6639; cleaned-up: 0- indexing messages; checked: 6674; updated/new: 6673; cleaned-up: 0\ indexing messages; checked: 6713; updated/new: 6712; cleaned-up: 0| indexing messages; checked: 6757; updated/new: 6756; cleaned-up: 0/ indexing messages; checked: 6797; updated/new: 6796; cleaned-up: 0- indexing messages; checked: 6837; updated/new: 6836; cleaned-up: 0\ indexing messages; checked: 6877; updated/new: 6876; cleaned-up: 0| indexing messages; checked: 6912; updated/new: 6911; cleaned-up: 0/ indexing messages; checked: 6947; updated/new: 6946; cleaned-up: 0- indexing messages; checked: 6975; updated/new: 6974; cleaned-up: 0\ indexing messages; checked: 7001; updated/new: 7000; cleaned-up: 0| indexing messages; checked: 7037; updated/new: 7036; cleaned-up: 0/ indexing messages; checked: 7072; updated/new: 7071; cleaned-up: 0- indexing messages; checked: 7098; updated/new: 7097; cleaned-up: 0\ indexing messages; checked: 7123; updated/new: 7122; cleaned-up: 0| indexing messages; checked: 7153; updated/new: 7152; cleaned-up: 0/ indexing messages; checked: 7177; updated/new: 7176; cleaned-up: 0- indexing messages; checked: 7205; updated/new: 7204; cleaned-up: 0\ indexing messages; checked: 7238; updated/new: 7237; cleaned-up: 0| indexing messages; checked: 7270; updated/new: 7269; cleaned-up: 0/ indexing messages; checked: 7313; updated/new: 7312; cleaned-up: 0- indexing messages; checked: 7344; updated/new: 7343; cleaned-up: 0\ indexing messages; checked: 7377; updated/new: 7376; cleaned-up: 0| indexing messages; checked: 7409; updated/new: 7408; cleaned-up: 0/ indexing messages; checked: 7440; updated/new: 7439; cleaned-up: 0- indexing messages; checked: 7480; updated/new: 7479; cleaned-up: 0\ indexing messages; checked: 7516; updated/new: 7515; cleaned-up: 0| indexing messages; checked: 7560; updated/new: 7559; cleaned-up: 0/ indexing messages; checked: 7598; updated/new: 7597; cleaned-up: 0- indexing messages; checked: 7634; updated/new: 7633; cleaned-up: 0\ indexing messages; checked: 7670; updated/new: 7669; cleaned-up: 0| indexing messages; checked: 7714; updated/new: 7713; cleaned-up: 0/ indexing messages; checked: 7760; updated/new: 7759; cleaned-up: 0- indexing messages; checked: 7793; updated/new: 7792; cleaned-up: 0\ indexing messages; checked: 7831; updated/new: 7830; cleaned-up: 0| indexing messages; checked: 7866; updated/new: 7865; cleaned-up: 0/ indexing messages; checked: 7901; updated/new: 7900; cleaned-up: 0- indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0\ indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0| indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0/ indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0- indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0\ indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0| indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0/ indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0- indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0\ indexing messages; checked: 7935; updated/new: 7934; cleaned-up: 0| indexing messages; checked: 7954; updated/new: 7953; cleaned-up: 0/ indexing messages; checked: 7989; updated/new: 7988; cleaned-up: 0- indexing messages; checked: 8031; updated/new: 8030; cleaned-up: 0\ indexing messages; checked: 8064; updated/new: 8063; cleaned-up: 0| indexing messages; checked: 8100; updated/new: 8099; cleaned-up: 0/ indexing messages; checked: 8138; updated/new: 8137; cleaned-up: 0- indexing messages; checked: 8175; updated/new: 8174; cleaned-up: 0\ indexing messages; checked: 8206; updated/new: 8205; cleaned-up: 0| indexing messages; checked: 8242; updated/new: 8241; cleaned-up: 0/ indexing messages; checked: 8275; updated/new: 8274; cleaned-up: 0- indexing messages; checked: 8320; updated/new: 8319; cleaned-up: 0\ indexing messages; checked: 8365; updated/new: 8364; cleaned-up: 0| indexing messages; checked: 8402; updated/new: 8401; cleaned-up: 0/ indexing messages; checked: 8439; updated/new: 8438; cleaned-up: 0- indexing messages; checked: 8471; updated/new: 8470; cleaned-up: 0\ indexing messages; checked: 8503; updated/new: 8502; cleaned-up: 0| indexing messages; checked: 8538; updated/new: 8537; cleaned-up: 0/ indexing messages; checked: 8580; updated/new: 8579; cleaned-up: 0- indexing messages; checked: 8615; updated/new: 8614; cleaned-up: 0\ indexing messages; checked: 8650; updated/new: 8649; cleaned-up: 0| indexing messages; checked: 8684; updated/new: 8683; cleaned-up: 0/ indexing messages; checked: 8720; updated/new: 8719; cleaned-up: 0- indexing messages; checked: 8754; updated/new: 8753; cleaned-up: 0\ indexing messages; checked: 8786; updated/new: 8785; cleaned-up: 0| indexing messages; checked: 8813; updated/new: 8812; cleaned-up: 0/ indexing messages; checked: 8847; updated/new: 8846; cleaned-up: 0- indexing messages; checked: 8885; updated/new: 8884; cleaned-up: 0\ indexing messages; checked: 8916; updated/new: 8915; cleaned-up: 0| indexing messages; checked: 8950; updated/new: 8949; cleaned-up: 0/ indexing messages; checked: 8991; updated/new: 8990; cleaned-up: 0- indexing messages; checked: 9036; updated/new: 9035; cleaned-up: 0\ indexing messages; checked: 9072; updated/new: 9071; cleaned-up: 0| indexing messages; checked: 9114; updated/new: 9113; cleaned-up: 0/ indexing messages; checked: 9154; updated/new: 9153; cleaned-up: 0- indexing messages; checked: 9190; updated/new: 9189; cleaned-up: 0\ indexing messages; checked: 9224; updated/new: 9223; cleaned-up: 0| indexing messages; checked: 9258; updated/new: 9257; cleaned-up: 0/ indexing messages; checked: 9284; updated/new: 9283; cleaned-up: 0- indexing messages; checked: 9312; updated/new: 9311; cleaned-up: 0\ indexing messages; checked: 9349; updated/new: 9348; cleaned-up: 0| indexing messages; checked: 9377; updated/new: 9376; cleaned-up: 0/ indexing messages; checked: 9406; updated/new: 9405; cleaned-up: 0- indexing messages; checked: 9432; updated/new: 9431; cleaned-up: 0\ indexing messages; checked: 9456; updated/new: 9455; cleaned-up: 0| indexing messages; checked: 9482; updated/new: 9481; cleaned-up: 0/ indexing messages; checked: 9511; updated/new: 9510; cleaned-up: 0- indexing messages; checked: 9543; updated/new: 9542; cleaned-up: 0\ indexing messages; checked: 9578; updated/new: 9577; cleaned-up: 0| indexing messages; checked: 9616; updated/new: 9615; cleaned-up: 0/ indexing messages; checked: 9645; updated/new: 9644; cleaned-up: 0- indexing messages; checked: 9679; updated/new: 9678; cleaned-up: 0\ indexing messages; checked: 9707; updated/new: 9706; cleaned-up: 0| indexing messages; checked: 9741; updated/new: 9740; cleaned-up: 0/ indexing messages; checked: 9780; updated/new: 9779; cleaned-up: 0- indexing messages; checked: 9817; updated/new: 9816; cleaned-up: 0\ indexing messages; checked: 9857; updated/new: 9856; cleaned-up: 0| indexing messages; checked: 9894; updated/new: 9893; cleaned-up: 0/ indexing messages; checked: 9928; updated/new: 9927; cleaned-up: 0- indexing messages; checked: 9963; updated/new: 9962; cleaned-up: 0\ indexing messages; checked: 10006; updated/new: 10005; cleaned-up: 0| indexing messages; checked: 10053; updated/new: 10052; cleaned-up: 0/ indexing messages; checked: 10083; updated/new: 10082; cleaned-up: 0- indexing messages; checked: 10122; updated/new: 10121; cleaned-up: 0\ indexing messages; checked: 10154; updated/new: 10153; cleaned-up: 0| indexing messages; checked: 10187; updated/new: 10186; cleaned-up: 0/ indexing messages; checked: 10224; updated/new: 10223; cleaned-up: 0- indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0\ indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0| indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0/ indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0- indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0\ indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0| indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0/ indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0- indexing messages; checked: 10230; updated/new: 10229; cleaned-up: 0\ indexing messages; checked: 10233; updated/new: 10232; cleaned-up: 0| indexing messages; checked: 10269; updated/new: 10268; cleaned-up: 0/ indexing messages; checked: 10311; updated/new: 10310; cleaned-up: 0- indexing messages; checked: 10344; updated/new: 10343; cleaned-up: 0\ indexing messages; checked: 10381; updated/new: 10380; cleaned-up: 0| indexing messages; checked: 10414; updated/new: 10413; cleaned-up: 0/ indexing messages; checked: 10452; updated/new: 10451; cleaned-up: 0- indexing messages; checked: 10486; updated/new: 10485; cleaned-up: 0\ indexing messages; checked: 10517; updated/new: 10516; cleaned-up: 0| indexing messages; checked: 10547; updated/new: 10546; cleaned-up: 0/ indexing messages; checked: 10585; updated/new: 10584; cleaned-up: 0- indexing messages; checked: 10625; updated/new: 10624; cleaned-up: 0\ indexing messages; checked: 10668; updated/new: 10668; cleaned-up: 0| indexing messages; checked: 10703; updated/new: 10702; cleaned-up: 0/ indexing messages; checked: 10737; updated/new: 10736; cleaned-up: 0- indexing messages; checked: 10771; updated/new: 10770; cleaned-up: 0\ indexing messages; checked: 10800; updated/new: 10799; cleaned-up: 0| indexing messages; checked: 10835; updated/new: 10834; cleaned-up: 0/ indexing messages; checked: 10875; updated/new: 10874; cleaned-up: 0- indexing messages; checked: 10910; updated/new: 10909; cleaned-up: 0\ indexing messages; checked: 10944; updated/new: 10943; cleaned-up: 0| indexing messages; checked: 10977; updated/new: 10976; cleaned-up: 0/ indexing messages; checked: 11010; updated/new: 11009; cleaned-up: 0- indexing messages; checked: 11045; updated/new: 11044; cleaned-up: 0\ indexing messages; checked: 11070; updated/new: 11069; cleaned-up: 0| indexing messages; checked: 11102; updated/new: 11101; cleaned-up: 0/ indexing messages; checked: 11132; updated/new: 11131; cleaned-up: 0- indexing messages; checked: 11165; updated/new: 11164; cleaned-up: 0\ indexing messages; checked: 11199; updated/new: 11198; cleaned-up: 0| indexing messages; checked: 11242; updated/new: 11241; cleaned-up: 0/ indexing messages; checked: 11281; updated/new: 11280; cleaned-up: 0- indexing messages; checked: 11321; updated/new: 11320; cleaned-up: 0\ indexing messages; checked: 11359; updated/new: 11358; cleaned-up: 0| indexing messages; checked: 11391; updated/new: 11390; cleaned-up: 0/ indexing messages; checked: 11418; updated/new: 11417; cleaned-up: 0- indexing messages; checked: 11445; updated/new: 11444; cleaned-up: 0\ indexing messages; checked: 11479; updated/new: 11478; cleaned-up: 0| indexing messages; checked: 11508; updated/new: 11507; cleaned-up: 0/ indexing messages; checked: 11530; updated/new: 11529; cleaned-up: 0- indexing messages; checked: 11556; updated/new: 11555; cleaned-up: 0\ indexing messages; checked: 11586; updated/new: 11585; cleaned-up: 0| indexing messages; checked: 11622; updated/new: 11621; cleaned-up: 0/ indexing messages; checked: 11659; updated/new: 11658; cleaned-up: 0- indexing messages; checked: 11687; updated/new: 11686; cleaned-up: 0\ indexing messages; checked: 11722; updated/new: 11721; cleaned-up: 0| indexing messages; checked: 11750; updated/new: 11749; cleaned-up: 0/ indexing messages; checked: 11787; updated/new: 11786; cleaned-up: 0- indexing messages; checked: 11822; updated/new: 11821; cleaned-up: 0\ indexing messages; checked: 11864; updated/new: 11863; cleaned-up: 0| indexing messages; checked: 11902; updated/new: 11901; cleaned-up: 0/ indexing messages; checked: 11934; updated/new: 11933; cleaned-up: 0- indexing messages; checked: 11969; updated/new: 11968; cleaned-up: 0\ indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0| indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0/ indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0- indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0\ indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0| indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0/ indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0- indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0\ indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0| indexing messages; checked: 11996; updated/new: 11995; cleaned-up: 0/ indexing messages; checked: 12010; updated/new: 12009; cleaned-up: 0- indexing messages; checked: 12043; updated/new: 12042; cleaned-up: 0\ indexing messages; checked: 12082; updated/new: 12081; cleaned-up: 0| indexing messages; checked: 12112; updated/new: 12111; cleaned-up: 0/ indexing messages; checked: 12150; updated/new: 12149; cleaned-up: 0- indexing messages; checked: 12193; updated/new: 12192; cleaned-up: 0\ indexing messages; checked: 12226; updated/new: 12225; cleaned-up: 0| indexing messages; checked: 12258; updated/new: 12257; cleaned-up: 0/ indexing messages; checked: 12288; updated/new: 12287; cleaned-up: 0- indexing messages; checked: 12327; updated/new: 12326; cleaned-up: 0\ indexing messages; checked: 12361; updated/new: 12360; cleaned-up: 0| indexing messages; checked: 12395; updated/new: 12394; cleaned-up: 0/ indexing messages; checked: 12428; updated/new: 12427; cleaned-up: 0- indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0\ indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0| indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0/ indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0- indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0\ indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0| indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0/ indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0- indexing messages; checked: 12441; updated/new: 12440; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0/ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0- indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0\ indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0| indexing messages; checked: 12447; updated/new: 12447; cleaned-up: 0
#+end_example
